#include<iostream>
#include<cstdio>
#include<cmath>
#include<algorithm>

using namespace std;

struct TBal {
	int c,b;
};

int a[100001], bb, n, k;										// bb е броя на различните цветове
TBal b[100001];

int main(){

int bb=0, i, j;

	scanf("%d%d", &n, &k);
	for (i = 1; i <= n; i++)
		scanf("%d", &a[i]);
	sort(a+1, a + n+1);												// сортираме цветовете в нарастващ ред
	bb=1; b[1].c=a[1]; b[1].b=1;								// Образуваме b[1] от структурата TBal
	for (i = 2; i <= n; i++)
		if (a[i]==a[i-1])										// срещаме същия цвят
			b[bb].b++;											// Вдига брояча b[bb].b на текучщия цвят bb
			else {												// при нов цвят
				bb++;											// вдига брояча bb на broq na цветовете
				b[bb].c=a[i];									// прави цвета b[bb].c равен на новия цвят a[i]
				b[bb].b=1;										// установява брояча b[bb].b да е 1
			}
// k<=bb - броят на балоните НЕ е по-голям
// от броя на различните цветове
	if (k<=bb) {
		for (i = 1; i <= k; i++)								// Отпечатва по един балон от първите k цвята
			cout<<b[i].c<<" ";
		cout<<endl;
		return 0;
	}
// k > bb - броят на балоните е по-голям
// от броя на различните цветове
int Ost=k-bb;													// OSt - колко балона остават да се отпечатат
																// вземаме по един балон от всеки цвят, затова
																// изваждаме bb
	for (i=1; i<=bb;i++){										// обхождаме цветовете
		if (b[i].b-1<= Ost) {									// броят на балоните от цвят i е по-малък от остатъка
			for (j=1; j<=b[i].b; j++) cout<<b[i].c<<" ";		// отпечатваме номерата на балоните от цвят i
			Ost=Ost-(b[i].b-1);									// намаляваме Ost с броя на отпечатаните балони
		}
		else {
			for (j=1; j<=Ost+1; j++) cout<<b[i].c<<" ";			// Отпечатваме колкото балона остават, но плюс единия, ойто
																// сме взели в началото
			Ost=0;												// нулираме остатъка при балон с цвят i
		}

		if (Ost==0)												// прекъсваме цикъла, остана да се отпечатат по
			break;												// един баон от останалите цветове след i-я
	}

	for (j=i+1; j<=bb;j++) cout<<b[j].c<<" ";					// отпечатваме по един цвят от всички цветове
	cout<<endl;													// от i+1 до края

	return 0;
}
